API_ID = '' 
API_HASH = ''
CHANNEL_NAME = '' 
PHONE_NUMBER = '79313332211' # пример 


'''Для использования библиотеки Telethon вам нужно получить api_id и api_hash через Telegram API.

Вот шаги для получения api_id и api_hash:

Зарегистрируйте приложение:

Перейдите по ссылке https://my.telegram.org/auth.
Войдите в свой аккаунт Telegram (если необходимо).
Создайте новое приложение (проект).
Заполните форму, предоставив необходимую информацию.
Получите api_id и api_hash:

После регистрации приложения вы получите api_id и api_hash.
Обязательно сохраните их в безопасном месте, так как они будут использоваться для аутентификации вашего приложения.
'''